artillery/tests/renewTokenTest.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:8080/api
  phases:
    - duration: 60 # Seconds that this phase will last
      arrivalRate: 1 # 1 new virtual user per second
      rampTo: 5 # gradually ramp up to 5 new users per second
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    apdex:
      threshold: 500
    metrics-by-endpoint: {}
scenarios:
  - flow:
      - post:
          url: '/renewToken'
          json:
            token: 'test-token'
      - loop:
          - get:
              url: '/dino'
          - get:
              url: '/pony'
          - get:
              url: '/armadillo'
        count: 100