artillery/tests/singleRenewTokenTest.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:8080/api
  phases:
    - duration: 1 # Seconds that this phase will last
      arrivalRate: 1 # 1 new virtual user per second
      name: Main Test
  processor: '../processors/authProcessor.cjs'
  variables:
    plan:
      - 'basic'
      - 'advanced'
      - 'premium'
    addOn:
      - 'extraTimers'
      - 'exportAsJson'
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    apdex:
      threshold: 300
    metrics-by-endpoint: {}
scenarios:
  - flow:      
    - post:
        url: '/contracts/renew-token'
        headers:
          Content-Type: application/json
          user-id: 'testUserId'