artillery/tests/space.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost/api/v1
  phases:
    - duration: 60 # Seconds that this phase will last
      arrivalRate: 5 # 1 new virtual user per second
      rampTo: 10 # gradually ramp up to 5 new users per second
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
    - duration: 30
      arrivalRate: 100
      name: Spike phase
  processor: '../processors/authProcessor.cjs'
  variables:
    plan:
      - 'basic'
      - 'advanced'
      - 'premium'
    addOn:
      - 'extraTimers'
      - 'exportAsJson'
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    apdex:
      threshold: 300
    metrics-by-endpoint: {}
    fake-data: {}
scenarios:
  - flow:
      - post:
          url: '/contracts'
          beforeRequest: getRandomCredentials
          headers:
            Content-Type: application/json
            x-api-key: 'b723fa3454933c95de3426cc3553cd68df88b81c3af3bba83943b3c1d78c1b05'
          json:
            userContact:
              userId: '{{ generatedUserId }}'
              username: '{{ generatedUserId }}'
            billingPeriod:
              autoRenew: true
              renewalDays: 365
            contractedServices:
              tomatometer: "1.0.0"
            subscriptionPlans:
              tomatometer: '{{ plan }}'
            subscriptionAddOns:
              tomatometer:
                '{{ addOn }}': 1
          capture: 
            - json: '$.userContact.userId'
              as: 'userId'
      - loop:
          - put:
              url: '/contracts/{{ userId }}'
              headers:
                Content-Type: application/json
                x-api-key: 'b723fa3454933c95de3426cc3553cd68df88b81c3af3bba83943b3c1d78c1b05'
              json:
                contractedServices:
                  tomatometer: 1.0.0
                subscriptionPlans:
                  tomatometer: '{{ plan }}'
                subscriptionAddOns:
                  tomatometer: 
                    '{{ addOn }}': 1
          - post:
              url: '/features/{{ userId }}/pricing-token'
              headers:
                Content-Type: application/json
                x-api-key: 'b723fa3454933c95de3426cc3553cd68df88b81c3af3bba83943b3c1d78c1b05'
        count: 10